slashphotos/Mowgli/stm32/ros_usbnode/src/main.c
/**
 ******************************************************************************
 * @file    main.c
 * @author  Georg Swoboda <cn@warp.at>
 * @date    21/09/2022
 * @version 1.0.0
 * @brief   main / bootup and initialization, motor control routines, usb init
 ******************************************************************************
 *
 * compile with -DBOARD_YARDFORCE500 to enable the YF500 GForce pinout
 *
 * ROS integration howto taken from here: https://github.com/Itamare4/ROS_stm32f1_rosserial_USB_VCP (Itamar Eliakim)
 *
 ******************************************************************************
 */

#include "board.h"
#include <stdio.h>
#include <stdbool.h>
#include <stdarg.h>
#include <math.h>
#include <string.h>
#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal_uart.h"
#include "stm32f4xx_hal_adc.h"
#include "main.h"
// stm32 custom
#include "panel.h"
#include "blademotor.h"
#include "drivemotor.h"
#include "emergency.h"
#include "blademotor.h"
#include "drivemotor.h"
#include "tim.h"
//#include "ultrasonic_sensor.h"
#include "perimeter.h"
#include "adc.h"
#include "charger.h"
#include "soft_i2c.h"
#include "spiflash.h"
#include "i2c.h"
#include "imu/imu.h"
#include "usb_device.h"
#include "usbd_cdc_if.h"
#include "nbt.h"
#include "dma.h"
#include "wwdg.h"

// ros
#include "cpp_main.h"
#include "ringbuffer.h"

#define ROS_PUBLISH_MOWGLI 1
uint8_t usb_serial_command[64];

//static void WATCHDOG_vInit(void);
//tatic void WATCHDOG_Refresh(void);
void TIM4_Init(void);
void HALLSTOP_Sensor_Init(void);

static nbt_t main_chargecontroller_nbt;
static nbt_t main_statusled_nbt;
static nbt_t main_emergency_nbt;
static nbt_t main_blademotor_nbt;
static nbt_t main_drivemotor_nbt;
static nbt_t main_wdg_nbt;
static nbt_t main_buzzer_nbt;
static nbt_t main_ultrasonicsensor_nbt;

volatile uint8_t master_tx_busy = 0;
static uint8_t master_tx_buffer_len;
static char master_tx_buffer[255];

uint8_t do_chirp_duration_counter;
uint8_t do_chirp = 0;

openmower_status_e main_eOpenmowerStatus = OPENMOWER_STATUS_IDLE;

UART_HandleTypeDef MASTER_USART_Handler; // UART  Handle

// Drive Motors DMA
DMA_HandleTypeDef hdma_uart4_rx;
DMA_HandleTypeDef hdma_uart4_tx;
TIM_HandleTypeDef TIM3_Handle; // PWM Beeper
TIM_HandleTypeDef TIM4_Handle; // PWM Buzzer
IWDG_HandleTypeDef IwdgHandle = {0};
WWDG_HandleTypeDef WwdgHandle = {0};

typedef enum {
    DISARMED=0,
    ARMED
}STATE_e;


STATE_e status = DISARMED;

int main(void)
{
  HAL_Init();
  SystemClock_Config();

  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USB_DEVICE_Init();
  MX_USART2_UART_Init();
  MX_ADC1_Init();
  MX_TIM2_Init();
  MX_RTC_Init();
  MX_USART6_UART_Init();
  MX_TIM1_Init();
  MX_WWDG_Init();
  MX_TIM3_Init();
  /* USER CODE BEGIN 2 */
  logSerial("System Boot Completed!\n");
  logSerial("Services Initializations started...\n");
  memset (usb_serial_command, '\0', 64);  // clear the buffer
  HAL_GPIO_WritePin(Led_D3_GPIO_Port, Led_D3_Pin,1);
  
  /* init Status update variables*/
  int cycle = 0;

  /* Enable high voltage*/
  HAL_GPIO_WritePin(High_Voltage_Enable_GPIO_Port, High_Voltage_Enable_Pin, 1);
  logSerial("High Voltage Circuit: On\n");


  /* Initialize Driver Motors ESC */
  DRIVEMOTOR_Init();
  logSerial("Driver Motors: Ready\n");
    /* Initialize Blade Motors ESC */
  BLADEMOTOR_Init();
  logSerial("Blade Motor: Ready\n");

  /* Initilize Charge Controler*/
  TIM1->CCR1 = 0;  
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
  HAL_TIMEx_PWMN_Start(&htim1, TIM_CHANNEL_1);
  logSerial("Charge Controler PWM Timers initialized!\n");

  /* Initializing Charger*/
  CHARGER_Init();

  /* Initializing Buzzer*/
  TIM3->CCR4 = 0;  
  HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_4);
  BUZZER_SET(1);
  HAL_Delay (500);
  BUZZER_SET(0);
  logSerial("Buzzer initialized!\n");

  if (SPIFLASH_TestDevice())
  {
    SPIFLASH_Config();
    SPIFLASH_IncBootCounter();
  }
  else
  {
    DB_TRACE(" * SPIFLASH: unable to locate SPI Flash\r\n");
  }
  DB_TRACE(" * SPIFLASH initialized\r\n");
  
  I2C_Init();
  DB_TRACE(" * Hard I2C initialized\r\n");
  if (I2C_Acclerometer_TestDevice())
  {
    I2C_Accelerometer_Setup();
  }
  else
  {
    chirp(3);
    DB_TRACE(" * WARNING: initalization of onboard accelerometer for tilt protection failed !\r\n");
  }
  DB_TRACE(" * Accelerometer (onboard/tilt safety) initialized\r\n");
  SW_I2C_Init();
  DB_TRACE(" * Soft I2C (J18) initialized\r\n");
  DB_TRACE(" * Testing supported IMUs:\r\n");
  IMU_TestDevice();
  IMU_Init();
  IMU_Calibrate();
  EMERGENCY_Init();
  logSerial("Services Initializations completed!\n");
  
  
  //PANEL_Init();
  //DB_TRACE(" * Panel initialized\r\n");
 
  // Initialize Main Timers
  NBT_init(&main_chargecontroller_nbt, 10);
  NBT_init(&main_statusled_nbt, 1000);
  NBT_init(&main_emergency_nbt, 10);
#if (DEBUG_TYPE != DEBUG_TYPE_UART) && (OPTION_ULTRASONIC == 1)
  NBT_init(&main_ultrasonicsensor_nbt, 50);
#endif
  NBT_init(&main_blademotor_nbt, 100);
  NBT_init(&main_drivemotor_nbt, 20);
  NBT_init(&main_wdg_nbt, 10);
  NBT_init(&main_buzzer_nbt, 200);

  DB_TRACE(" * NBT Main timers initialized\r\n");

#ifdef I_DONT_NEED_MY_FINGERS
  DB_TRACE("\r\n");
  DB_TRACE("=========================================================\r\n");
  DB_TRACE(" EMERGENCY/SAFETY FEATURES ARE DISABLED IN board.h ! \r\n");
  DB_TRACE("=========================================================\r\n");
  DB_TRACE("\r\n");
#endif
  // Initialize ROS
  init_ROS();
  DB_TRACE(" * ROS serial node initialized\r\n");
  DB_TRACE("\r\n >>> entering main loop ...\r\n\r\n");
  // <chirp><chirp> means we are in the main loop
  chirp(2);

  while (1)
  {
    chatter_handler();
    motors_handler();
    //panel_handler();
    spinOnce();
    broadcast_handler();

    //DRIVEMOTOR_App_Rx();
    // Perimeter_vApp();

    if (NBT_handler(&main_chargecontroller_nbt))
    {
      ADC_Update();
      CHARGER_Update();
    }
    if (NBT_handler(&main_statusled_nbt))
    {
      StatusLEDUpdate();

      // DB_TRACE("master_rx_STATUS: %d  drivemotors_rx_buf_idx: %d  cnt_usart2_overrun: %x\r\n", master_rx_STATUS, drivemotors_rx_buf_idx, cnt_usart2_overrun);
    }
#if (DEBUG_TYPE != DEBUG_TYPE_UART) && (OPTION_ULTRASONIC == 1)
    /* try to send ros message without delay*/
    if (ULTRASONIC_MessageReceived() == 1)
    {
      ultrasonic_handler();
    }
    if (NBT_handler(&main_ultrasonicsensor_nbt))
    {
      ULTRASONICSENSOR_App();
    }
#endif
#if 0
    if (NBT_handler(&main_wdg_nbt))
    {
      WATCHDOG_Refresh();
    }
#endif
    if (NBT_handler(&main_drivemotor_nbt))
    {
      DRIVEMOTOR_Run();
    }

    if (NBT_handler(&main_blademotor_nbt))
    {

      uint32_t currentTick;
      static uint32_t old_tick;

      BLADEMOTOR_Run();

      // DB_TRACE(" temp : %.2f \n",blade_temperature);
      currentTick = HAL_GetTick();
      DB_TRACE("t: %d \n", (currentTick - old_tick));
      old_tick = currentTick;
    }

    if (NBT_handler(&main_buzzer_nbt))
    {
      // TODO
      if (do_chirp)
      {
        TIM3_Handle.Instance->CCR4 = 10; // chirp on
        TIM4_Handle.Instance->CCR3 = 10; // chirp on
        do_chirp--;
        do_chirp_duration_counter = 0;
      }
      if (do_chirp_duration_counter == 1)
      {
        TIM3_Handle.Instance->CCR4 = 0; // chirp off
        TIM4_Handle.Instance->CCR3 = 0; // chirp off
      }
      do_chirp_duration_counter++;
    }

#ifndef I_DONT_NEED_MY_FINGERS
    if (NBT_handler(&main_emergency_nbt))
    {
      EMERGENCY_Update();
    }
    cycle++;
    if(cycle%10==0){  //100ms
      HAL_GPIO_TogglePin (Led_D3_GPIO_Port, Led_D3_Pin);
    }
    if(cycle%100==0){ //1s
       // STATE_Send();
    }
    if(cycle>1000){
      cycle=1;
    }
    HAL_WWDG_Refresh(&hwwdg);
#endif
  }
  /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  // we never get here ...
  /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
}

/**
 * @brief Init the Master Serial Port  - this what connects to the upstream controller
 * @retval None
 */
void MASTER_USART_Init()
{
#ifndef BOARD_YARDFORCE500B
  // enable port and usart clocks
  MASTER_USART_GPIO_CLK_ENABLE();
  MASTER_USART_USART_CLK_ENABLE();

  GPIO_InitTypeDef GPIO_InitStruct;
  // RX
  GPIO_InitStruct.Pin = MASTER_USART_RX_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Alternate = GPIO_AF8_USART6;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init(MASTER_USART_RX_PORT, &GPIO_InitStruct);

  // TX
  GPIO_InitStruct.Pin = MASTER_USART_TX_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Alternate = GPIO_AF8_USART6;
  // GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init(MASTER_USART_TX_PORT, &GPIO_InitStruct);

  MASTER_USART_Handler.Instance = MASTER_USART_INSTANCE;     // USART1 (DEV)
  MASTER_USART_Handler.Init.BaudRate = 115200;               // Baud rate
  MASTER_USART_Handler.Init.WordLength = UART_WORDLENGTH_8B; // The word is  8  Bit format
  MASTER_USART_Handler.Init.StopBits = USART_STOPBITS_1;     // A stop bit
  MASTER_USART_Handler.Init.Parity = UART_PARITY_NONE;       // No parity bit
  MASTER_USART_Handler.Init.HwFlowCtl = UART_HWCONTROL_NONE; // No hardware flow control
  MASTER_USART_Handler.Init.Mode = USART_MODE_TX_RX;         // Transceiver mode

  HAL_UART_Init(&MASTER_USART_Handler); // HAL_UART_Init() Will enable  UART1

