slashphotos/Mowgli/stm32/ros_usbnode/src/main.c
  /* USER CODE END TIM3_MspPostInit 1 */
  }

}

void HAL_TIM_Base_MspDeInit(TIM_HandleTypeDef* tim_baseHandle)
{

  if(tim_baseHandle->Instance==TIM1)
  {
  /* USER CODE BEGIN TIM1_MspDeInit 0 */

  /* USER CODE END TIM1_MspDeInit 0 */
    /* Peripheral clock disable */
    __HAL_RCC_TIM1_CLK_DISABLE();
  /* USER CODE BEGIN TIM1_MspDeInit 1 */

  /* USER CODE END TIM1_MspDeInit 1 */
  }
  else if(tim_baseHandle->Instance==TIM3)
  {
  /* USER CODE BEGIN TIM3_MspDeInit 0 */

  /* USER CODE END TIM3_MspDeInit 0 */
    /* Peripheral clock disable */
    __HAL_RCC_TIM3_CLK_DISABLE();
  /* USER CODE BEGIN TIM3_MspDeInit 1 */

  /* USER CODE END TIM3_MspDeInit 1 */
  }
}

void HAL_TIM_PWM_MspDeInit(TIM_HandleTypeDef* tim_pwmHandle)
{

  if(tim_pwmHandle->Instance==TIM2)
  {
  /* USER CODE BEGIN TIM2_MspDeInit 0 */

  /* USER CODE END TIM2_MspDeInit 0 */
    /* Peripheral clock disable */
    __HAL_RCC_TIM2_CLK_DISABLE();
  /* USER CODE BEGIN TIM2_MspDeInit 1 */

  /* USER CODE END TIM2_MspDeInit 1 */
  }
}

/*
 * Initialize Watchdog - not tested yet (by Nekraus)
 */
static void WATCHDOG_vInit(void)
{
  #if 0
#if defined(DB_ACTIVE)
  /* setup DBGMCU block - stop IWDG at break in debug mode */
  __HAL_FREEZE_IWDG_DBGMCU();
#endif /* DB_ACTIVE */

  /* change the period to 50ms */
  IwdgHandle.Instance = IWDG;
  IwdgHandle.Init.Prescaler = IWDG_PRESCALER_256;
  IwdgHandle.Init.Reload = 0xFFF;
  /* Enable IWDG (LSI automatically enabled by HW) */

  /* if window feature is not applied Init() precedes Start() */
  if (HAL_IWDG_Init(&IwdgHandle) != HAL_OK)
  {
#ifdef DB_ACTIVE
    DB_TRACE(" IWDG init Error\n\r");
#endif /* DB_ACTIVE */
  }

/* Initialize WWDG for run time if applicable */
#if defined(DB_ACTIVE)
  /* setup DBGMCU block - stop WWDG at break in debug mode */
  __HAL_FREEZE_WWDG_DBGMCU();
#endif /* DB_ACTIVE */

  /* Setup period - 20ms */
  __WWDG_CLK_ENABLE();
  WwdgHandle.Instance = WWDG;
  WwdgHandle.Init.Prescaler = WWDG_PRESCALER_8;
  WwdgHandle.Init.Counter = 0x7F; /* 40.02 ms*/
  WwdgHandle.Init.Window = 0x7F;  /* 0ms */
  // if( HAL_WWDG_Init(&WwdgHandle) != HAL_OK )
  {
#ifdef DB_ACTIVE
    DB_TRACE(" WWDG init Error\n\r");
#endif /* DB_ACTIVE */
  }
} /* WATCHDOG_vInit() */

/*
 * Feed the watchdog every 10ms
 */
static void WATCHDOG_Refresh(void)
{
  /* Update WWDG counter */
  WwdgHandle.Instance = WWDG;
  if (HAL_WWDG_Refresh(&WwdgHandle) != HAL_OK)
  {
#ifdef DB_ACTIVE
    DB_TRACE(" WWDG refresh error\n\r");
#endif /* DB_ACTIVE */
  }

  /* Reload IWDG counter */
  IwdgHandle.Instance = IWDG;
  if (HAL_IWDG_Refresh(&IwdgHandle) != HAL_OK)
  {
#ifdef DB_ACTIVE
    DB_TRACE(" IWDG refresh error\n\r");
#endif /* DB_ACTIVE */
  }
  #endif
}

void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
  // do nothing here
}

/*
 * called when DMA transfer completes
 * update <xxxx>_tx_busy to let XXXX_Transmit function now when the DMA buffer is free
 */
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
#ifdef MASTER_USART_INSTANCE
  if (huart->Instance == MASTER_USART_INSTANCE)
  {
    if (__HAL_USART_GET_FLAG(&MASTER_USART_Handler, USART_FLAG_TC))
    {
      master_tx_busy = 0;
    }
  }
#endif
}

void HAL_UART_TxHalfCpltCallback(UART_HandleTypeDef *huart)
{
  // do nothing here
}

/*
 * Master UART receive ISR
 * DriveMotors UART receive ISR
 * PANEL UART receive ISR
 */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
#ifdef MASTER_USART_INSTANCE
  if (huart->Instance == MASTER_USART_INSTANCE)
  {
#if (DEBUG_TYPE != DEBUG_TYPE_UART) && (OPTION_ULTRASONIC == 1)
    ULTRASONICSENSOR_ReceiveIT();
#endif
  }
#endif
  if (huart->Instance == BLADEMOTOR_USART_INSTANCE)
  {
    BLADEMOTOR_ReceiveIT();
  }
  else if (huart->Instance == DRIVEMOTORS_USART_INSTANCE)
  {
    DRIVEMOTOR_ReceiveIT();
  }
}
#endif